# B"H

In [1]:
import pandas as pd

In [5]:
df = pd.DataFrame(
    [
        {'var1': 'a,b,c', 'var2': 1},
        {'var1': 'd,e,f', 'var2': 2}
    ]
)

In [6]:
df

    var1  var2
0  a,b,c     1
1  d,e,f     2

In [9]:
df_2 = pd.concat(
    [
        pd.Series(
            row['var2'], 
            row['var1'].split(',')
        )              
        for _, row in df.iterrows()
    ]
).reset_index()

In [10]:
df_2

  index  0
0     a  1
1     b  1
2     c  1
3     d  2
4     e  2
5     f  2

In [11]:
df_2.columns = ['var1', 'var2']

In [12]:
df_2

  var1  var2
0    a     1
1    b     1
2    c     1
3    d     2
4    e     2
5    f     2